tools/tmux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tmux</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">tmux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org367dbb2">intro</a></li>
<li><a href="#orgd7fcfaf">help</a></li>
<li><a href="#orga2a6030">navigation</a></li>
<li><a href="#orge3e9400">session managment</a></li>
<li><a href="#org78f3957">copy and paste</a>
<ul>
<li><a href="#orge8bbbc2">copy-mode commands</a></li>
<li><a href="#org060fae7">paste buffers</a></li>
</ul>
</li>
<li><a href="#orgd4bf865">panes</a></li>
<li><a href="#orgbd9f4bb">suspend</a></li>
<li><a href="#orgebe6537">misc commands</a></li>
</ul>
</div>
</div>

<div id="outline-container-org367dbb2" class="outline-2">
<h2 id="org367dbb2">intro</h2>
<div class="outline-text-2" id="text-org367dbb2">
<pre class="example">
C-b c ; create new
C-b x ; quit
C-b : ; command prompt

sessions &gt; windows &gt; panes
</pre>
</div>
</div>

<div id="outline-container-orgd7fcfaf" class="outline-2">
<h2 id="orgd7fcfaf">help</h2>
<div class="outline-text-2" id="text-orgd7fcfaf">
<pre class="example">
C-b ? ; help
q ; quit
tmux list-keys
tmux list-commands
tmux info
tmux source-file ~/.tmux.conf ; reload current config
</pre>
</div>
</div>

<div id="outline-container-orga2a6030" class="outline-2">
<h2 id="orga2a6030">navigation</h2>
<div class="outline-text-2" id="text-orga2a6030">
<pre class="example">
Ctrl-b c	; new window
Ctrl-b n	; next window
Ctrl-b p	; previous window
Ctrl-b 0-9	; jump directly to a window by number
Ctrl-b w	; open a menu of all windows
Ctrl-b ,	; `rename-window'
Ctrl-b &amp;	; kill current
Ctrl-b ?	; help (q to quit)
C-b '		; prompt for window (enter index 0, 1 etc.)
</pre>
</div>
</div>

<div id="outline-container-orge3e9400" class="outline-2">
<h2 id="orge3e9400">session managment</h2>
<div class="outline-text-2" id="text-orge3e9400">
<pre class="example">
tmux new -s session_name
C-b d				; to disconnect
tmux list-sessions
tmux detach			; within a tmux session
tmux switch -t session_name
tmux attach			; to most recent
tmux attach-session -t 2	; -t target
tmux attach -t session_name
tmux kill-session -t 2
C-b $				; `rename-session'
</pre>
</div>
</div>

<div id="outline-container-org78f3957" class="outline-2">
<h2 id="org78f3957">copy and paste</h2>
<div class="outline-text-2" id="text-org78f3957">
<pre class="example">
1) C-b [ ; `copy-mode' wait for indicator in top right
2) select text
3) M-w   ; emacs binding? selection highlighted in orange
4) C-b ] ; `paste-buffer'
</pre>

<p>
this works between sessions
</p>
</div>

<div id="outline-container-orge8bbbc2" class="outline-3">
<h3 id="orge8bbbc2">copy-mode commands</h3>
<div class="outline-text-3" id="text-orge8bbbc2">
<pre class="example">
C-r ; search up
C-s ; search down
</pre>
</div>
</div>

<div id="outline-container-org060fae7" class="outline-3">
<h3 id="org060fae7">paste buffers</h3>
<div class="outline-text-3" id="text-org060fae7">
<pre class="example">
C-b = ; `choose-buffer'

C-b # ; `list-buffers'
C-b - ; `delete-buffer' 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4bf865" class="outline-2">
<h2 id="orgd4bf865">panes</h2>
<div class="outline-text-2" id="text-orgd4bf865">
<pre class="example">
C-b %     ; vertical split window into panes
C-b {     ; swap panes. C-b } also
C-b o     ; cycle
C-b !     ; send pane to new window.
C-b "     ; horizontal split
C-b q     ; Briefly display pane indexes.
C-b -&gt;/&lt;- ; change to pane

RESIZE
C-b C -&gt;/&lt;-	; Resize pane in steps of one cell.
C-b M -&gt;/&lt;-	; Resize pane in steps of five cells.
</pre>
</div>
</div>

<div id="outline-container-orgbd9f4bb" class="outline-2">
<h2 id="orgbd9f4bb">suspend</h2>
<div class="outline-text-2" id="text-orgbd9f4bb">
<pre class="example">
C-b C-z ; `suspend-client'
fg ; to unsuspend

% unsuspend?
</pre>
</div>
</div>

<div id="outline-container-orgebe6537" class="outline-2">
<h2 id="orgebe6537">misc commands</h2>
<div class="outline-text-2" id="text-orgebe6537">
<pre class="example">
C-b t ; time. `clock-mode'
</pre>

<p>
<a href="tools.html">back</a>
</p>
</div>
</div>
</div>
</body>
</html>
